app/views/users/show.html.erb

        <small>
          <div class='js-items-count'><%= pluralize(current_user.items.count, 'item') %></div>
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  ORDER BY updated_at DESC  [["user_id", 6]]
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ?  [["user_id", 6]]