app/views/items/_item.html.erb

INSERT INTO "items" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "lol okay"], ["user_id", 6], ["created_at", "2016-03-08 00:18:48.757567"], ["updated_at", "2016-03-08 00:18:48.757567"]]
---
    <small>
      added <%= distance_of_time_in_words(item.created_at, Time.now, options = {}) %> ago