app/views/items/create.js.erb

  $('.new-item').html("<%= escape_javascript(render partial: 'items/form', locals: { user: current_user, item: @new_item }) %>");
  $('.js-items-count').html("<%= pluralize(@item.user.items.count, 'item') %>");
---
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ?  [["user_id", 6]]