app/controllers/items_controller.rb

INSERT INTO "items" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "adding a new item"], ["user_id", 3], ["created_at", "2016-03-05 16:10:29.609910"], ["updated_at", "2016-03-05 16:10:29.609910"]]
---
  def create
    @item = current_user.items.new(item_params)
    @new_item = Item.new

    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."user_id" = ? AND "items"."id" = ?  ORDER BY updated_at DESC LIMIT 1  [["user_id", 6], ["id", 24]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 21]]
---
  def destroy
    @item = current_user.items.find(params[:id])
    if @item.destroy